In [11]:
import pandas as pd 
import numpy as np
import seaborn as sns 
import matplotlib as plt 
import sqlite3 as sql

In [16]:
# Create DB Connection 
database = "test.db"
connection = sql.connect(database)
cursor = connection.cursor()

In [17]:
query = '''SELECT * FROM clients'''

In [18]:
df = pd.read_sql_query(query,connection)
df.head()

   id             name gender  age
0   1  Jithendra Kumar   male   27
1   2          Praveen   male   25

In [20]:
ins_query = '''INSERT INTO clients( 'name', 'gender', 'age' ) VALUES ('Mahesh','male',27)'''
cursor.execute(ins_query)

In [21]:
df = pd.read_sql_query(query,connection)
df.head()

   id             name gender  age
0   1  Jithendra Kumar   male   27
1   2          Praveen   male   25
2   3           Mahesh   male   27

In [22]:
q2 = "SELECT  name FROM  sqlite_master WHER type ='table' AND name NOT LIKE 'sqlite_%'"
cursor.execute(q2)
print(cursor.fetchall())

[('clients',)]

In [23]:
df = pd.read_sql_query(query,connection)
df.head()

   id             name gender  age
0   1  Jithendra Kumar   male   27
1   2          Praveen   male   25
2   3           Mahesh   male   27